runArtillery.yml
config:
  target: 'http://localhost:3001'
  phases:
    - duration: 30
      arrivalRate: 10
  processor: "./generateArr.js"
scenarios:
  - flow:
    - loop:
      - get:
          url: "/api/photos/{{ $loopElement }}/restaurants"
      # - get:
      #     url: "/api/photos/{{ name }}/restaurants"
      over: {{ exportID }}
      # - post: 
      #     url: "/api/photos"
      #     json:
      #       url: 'Test_URL2'
      #       postdate: 'Test_PostDate2'
      #       caption: 'Test_Caption2'
      #       user: 1
      #       restaurant: 1